# Конвертер физических единиц

# Имеется массив вида:
PhysicalParamUnitsCalc_Ru = {'линейный размер' : {'мм' : 0.001 , 'м' : 1 , 'км' : 1000 , 'см' : 0.01 , 'фут' : 0.3048 , 'дюйм' : 0.0254 , 'стандартная морская миля' : 1852 , 'стандартная сухопутная миля' : 1609.344 , 'вершок' : 0.04445 , 'аршин' : 0.7112 , 'сажень' : 2.1336 , 'верста' : 1066.8} ,
                             'объем' : {'м³' : 1 , 'л' : 0.001 , 'чарка' : 1.2299E-4 , 'штоф' : 1.2299E-3 , 'ведро' : 0.012299 , 'бочка' : 0.49196 , 'пинта' : 0.56826125E-3 , 'галлон английский' : 4.54609E-3 , 'галлон американский' : 3.78541E-3 , 'баррель американский нефтяной' : 0.158988} ,
                             'масса' : {'кг' : 1 , 'т' : 1000 , 'г' : 0.001 , 'фунт британский (международный)' : 0.45359237 , 'унция' : 0.028349523125 , 'золотник' : 0.00426575417 , 'фунт русский' : 0.4095124 , 'пуд' : 16.3804964} ,
                             'угол' : {'радиан' : 1 , '°' : 0.017453292, "'" : 2.908882087E-4, '"' : 4.848136811E-6} ,
                             'сила' : {'Н': 1 , 'кгс' : 9.80665 , 'тс' : 9806.65 , 'дина' : 0.00001} ,
                             'температура' : {'°C' : ['x' , 'x_stand'] , 'К' : ['x-273.15' , 'x_stand+273.15'] , '°F' : ['(x-32)*5/9' , 'x_stand*9/5+32']} ,
                             'давление' : {'МПа' : 1000000 , 'кПа' : 1000 , 'кгс/см²' : 98066.5 , 'бар' : 100000 , 'м в.ст.' : 9806.65 , 'мм рт.ст.' : 133.322 , 'Па' : 1} ,
                             'энергия' : {'ГДж' : 1000000000 , 'МДж' : 1000000 , 'кДж' : 1000 , 'Гкал' : 4186800000 , 'ккал' : 4186.8 , 'кВт·ч' : 3600000 , 'Дж' : 1} ,
                             'мощность' : {'МВт' : 1000000 , 'кВт' : 1000 , 'Гкал/ч' : 1163000 , 'Вт' : 1 , 'л.с.' : 735.49875} ,
                             'массовый расход' : {'т/ч' : 0.277778 , 'кг/ч' : 0.000277778 , 'кг/с' : 1 , 'кг/мин' : 0.0166667} ,
                             'объемный расход' : {'м³/ч' : 0.000277778 , 'м³/мин' : 0.0166667 , 'м³/с' : 1 , 'л/мин' : 0.0000166667 , 'л/с' : 0.001} ,
                             'теплоемкость' : {'кДж/(кг·К)' : 1000 , 'ккал/(кг·°С)' : 4186.8 , 'Дж/(кг·К)' : 1} ,
                             'теплопроводность' : {'Вт/(м·К)' : 1 , 'ккал/(ч·м·°С)' : 1.163} ,
                             'динамическая вязкость' : {'Па·с' : 1 , 'мПа·с' : 0.001 , 'мкПа·с' : 0.000001 , 'П' : 0.1 , 'cП' : 0.001} ,
                             'кинематическая вязкость' : {'м²/с' : 1 , 'мм²/с' : 0.000001 , 'сСт' : 0.000001} ,
                             'термическое сопротивление' : {'(м²·К)/Вт' : 1 , '(ч·м²·°С)/ккал' : 0.859845} ,
                             'коэффициент теплоотдачи' : {'Вт/(м²·К)' : 1 , 'ккал/(ч·м²·°C)' : 1.163}
                            }

# Напишите функцию конвертации единиц измерения
# Входные параметры: Единица измерения из которой переводить, Единица измерения в которую необходимо перевести, Значение
# Выходные параметры: Значение после конвертации
# Предложите варианты более эффективной организации массива
